KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_ГрупповыеУпаковки/КАНАТ_ГрупповыеУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАНАТ_ГрупповыеУпаковки</name>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.КАНАТ_Поддон</types>
    </type>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/AccumulationRegisters/КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры/КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры</name>
  <resources>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрупповаяУпаковка</name>
    <type>
      <types>CatalogRef.КАНАТ_ГрупповыеУпаковки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиТЧ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТ_ТипЗаполненияГрупповойУпаковки/КАНАТ_ТипЗаполненияГрупповойУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТ_ТипЗаполненияГрупповойУпаковки</name>
  <enumValues>
    <name>Сборный</name>
  </enumValues>
  <enumValues>
    <name>Несборный</name>
  </enumValues>
  <enumValues>
    <name>Россыпь</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_ГрупповыеУпаковки/ManagerModule.bsl
//БИТ_Гурьев_ЧТЗ_2.16_17.05.24++
Функция ПолучитьТипЗаполнения(Ссылка, Поддон = Неопределено) Экспорт
	
	Если Не ТипЗнч(Ссылка) = Тип("СправочникСсылка.КАНАТ_ГрупповыеУпаковки") Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Поддон) Тогда
		
		Поддон = Ссылка.Поддон;
		
	КонецЕсли;
	
	Если Поддон.Вес = 25 Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.Россыпь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатурыОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры.Остатки КАК КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатурыОстатки
		|ГДЕ
		|	КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатурыОстатки.ГрупповаяУпаковка = &ГрупповаяУпаковка";
	
	Запрос.УстановитьПараметр("ГрупповаяУпаковка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Если Выгрузка.Количество() = 1 Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.Несборный;
	ИначеЕсли Выгрузка.Количество() > 1 Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.Сборный;
	КонецЕсли;
	
	Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.ПустаяСсылка();
	
КонецФункции //БИТ_Гурьев_ЧТЗ_2.16_17.05.24--
